Repository: tiagofur/creapolis-project
Catalog: creapolis_app/lib/l10n/app_*.arb
Languages: es

source: Connected
es: Conectado

source: Disconnected
es: Desconectado

source: Disconnect
es: Desconectar

source: Connect Google Calendar
es: Conectar Google Calendar

# connectedOn
source: Connected on {date}
es: Conectado el {date}

# cannotOpenBrowser
source: Could not open browser
es: No se pudo abrir el navegador

# googleCalendarAuthTitle
source: Google Calendar Authorization
es: Autorización de Google Calendar

# googleCalendarAuthInstructions
source: The browser has been opened. Please authorize the application and copy the authorization code here:
es: Se ha abierto tu navegador. Por favor autoriza la aplicación y copia el código de autorización aquí:

# authorizationCodeLabel
source: Authorization code
es: Código de autorización

# authorizationCodeHint
source: Paste the code here
es: Pega el código aquí

source: Connect
es: Conectar

# disconnectGoogleCalendarTitle
source: Disconnect Google Calendar
es: Desconectar Google Calendar

# notificationsComingSoon
source: Notifications settings coming soon
es: Configuración de notificaciones próximamente

# profileTitle
source: Profile
es: Perfil

# profileComingSoon
source: Profile settings coming soon
es: Configuración de perfil próximamente

# aboutComingSoon
source: App information coming soon
es: Información de la app próximamente

# googleCalendarConnected
source: Google Calendar connected successfully
es: Google Calendar conectado exitosamente

source: Google Calendar disconnected
es: Google Calendar desconectado
