Repository: tiagofur/creapolis-project
Catalog: creapolis_app/lib/l10n/app_*.arb
Languages: es

# notificationsTitle
source: Notifications
es: Notificaciones

# notificationsSubtitle
source: Manage notifications
es: Gestionar notificaciones

# themeTitle
source: Theme
es: Tema

# themeSubtitle
source: Light/Dark mode
es: Modo claro/oscuro

# helpTitle
source: Help
es: Ayuda

# helpSubtitle
source: Help center and support
es: Centro de ayuda y soporte

# privacyTitle
source: Privacy
es: Privacidad

# privacySubtitle
source: Privacy policy
es: Política de privacidad

# privacyContent
source: We manage your data with best practices. - Data use limited to functionality. - No third-party sharing without consent. - You can manage preferences in Settings. For details, see the official site.
es: Gestionamos tus datos conforme a las mejores prácticas. - Uso de datos limitado a funcionalidades. - Sin compartir con terceros sin consentimiento. - Puedes gestionar tus preferencias en Ajustes. Para más detalle, consulta el sitio oficial.

source: Close
es: Cerrar

source: Cancel
es: Cancelar

# workspaceActive
source: Active Workspace
es: Workspace Activo

# workspaceRequiredTitle
source: Workspace required
es: Workspace requerido

# workspaceRequiredMessage
source: To create tasks, select or create a workspace first.
es: Para crear tareas, primero debes seleccionar o crear un workspace.

source: Create Workspace
es: Crear Workspace

# selectProject
source: Select a project
es: Selecciona un proyecto

source: Add Widget / Create Project
es: Añadir Widget / Crear Proyecto

# updatingProjectsSnack
source: Updating project list...
es: Actualizando lista de proyectos...

# newTaskTooltip
source: New task
es: Nueva tarea

source: Open
es: Abrir

# taskCreatedSnack
source: Task "{title}" created
es: Tarea "{title}" creada

source: View more
es: Ver más

# percentageCompleted
source: {percent}% completed
es: {percent}% completado

# moreTitle
source: More options
es: Más opciones

# managementSection
source: Management
es: Gestión

# infoSection
source: Information
es: Información

# workspacesSubtitle
source: Manage workspaces
es: Gestionar workspaces

# invitationsTitle
source: Invitations
es: Invitaciones

# invitationsSubtitle
source: View pending invitations
es: Ver invitaciones pendientes

# settingsTitle
source: Settings
es: Ajustes

# settingsSubtitle
source: Application settings
es: Configuración de la aplicación

# customizationMetricsTitle
source: Customization Metrics
es: Métricas de Personalización

# customizationMetricsSubtitle
source: UI usage statistics
es: Estadísticas de uso de UI

# aboutTitle
source: About
es: Acerca de

# aboutSubtitle
source: Application information
es: Información de la aplicación

source: Log out
es: Cerrar Sesión

source: Edit profile
es: Editar perfil

# helpContent
source: Visit our help center for guides and support. Direct links from the app will be integrated soon.
es: Visita nuestro centro de ayuda para guías y soporte. Próximamente integraremos enlaces directos desde la app.

# recentActivityTitle
source: Recent Activity
es: Actividad Reciente

source: View all
es: Ver todo

source: No recent activity
es: No hay actividad reciente

# activityCompleted
source: Task completed
es: Tarea completada

# activityUpdated
source: Task updated
es: Tarea actualizada

# minutesAgo
source: {count} minutes ago
es: Hace {count} minutos

# hoursAgo
source: {count} hours ago
es: Hace {count} horas

# daysAgo
source: {count} days ago
es: Hace {count} días

# myTasksTitle
source: My Tasks
es: Mis Tareas

source: All clear!
es: ¡Todo al día!

# myProjectsTitle
source: My Projects
es: Mis Proyectos

# progressLabel
source: Progress
es: Progreso

# dailySummaryTitle
source: Daily Summary
es: Resumen del Día

# tasksLabel
source: Tasks
es: Tareas

# projectsLabel
source: Projects
es: Proyectos

# completedLabel
source: Completed
es: Completadas

source: Overall Progress
es: Progreso General

# upcomingTasksTitle
source: Upcoming Tasks
es: Próximas Tareas

# noPendingTasks
source: No pending tasks! ðŸŽ‰
es: ¡No hay tareas pendientes!

# tasksTitle
source: Tasks
es: Tareas

# myTasksTab
source: My Tasks
es: Mis Tareas

# allTasksTab
source: All
es: Todas

# createTaskTooltip
source: Create task
es: Crear tarea

# searchTasksTooltip
source: Search tasks
es: Buscar tareas

# filtersTooltip
source: Filters
es: Filtros

# sortTooltip
source: Sort
es: Ordenar

# sortByDate
source: By date
es: Por fecha

# sortByPriority
source: By priority
es: Por prioridad

# sortByName
source: By name
es: Por nombre

# selectWorkspaceTitle
source: Select a workspace
es: Selecciona un workspace

# selectWorkspaceMessage
source: Choose a workspace from the top switcher to view available tasks.
es: Elige un workspace desde el selector superior para ver las tareas disponibles.

source: Retry
es: Reintentar

# loadTasksErrorTitle
source: Tasks could not be loaded
es: No se pudieron cargar las tareas

# loginRequiredTitle
source: Log in to view your tasks
es: Inicia sesión para ver tus tareas

# loginRequiredMessage
source: You need to log in to see tasks assigned to you.
es: Necesitas iniciar sesión para ver las tareas asignadas a ti.

source: Go to login
es: Ir al login

source: Today
es: Hoy

source: This Week
es: Esta Semana

source: Upcoming
es: Próximas

# noDateGroup
source: Overdue or no date
es: Vencidas o sin fecha

source: All
es: Todas

source: In progress
es: En progreso

source: Planned
es: Planificadas

source: Completed
es: Completadas

# priorityCritical
source: Critical
es: Crítica

# priorityHigh
source: High
es: Alta

# priorityMedium
source: Medium
es: Media

# priorityLow
source: Low
es: Baja

# priorityLabel
source: Priority
es: Prioridad

source: Search
es: Buscar

source: Apply
es: Aplicar

source: Clear
es: Limpiar

# noResultsTitle
source: No results
es: Sin resultados

# noResultsMessage
source: We couldn't find tasks with the current filters.
es: No encontramos tareas con los filtros actuales.

source: Clear filters
es: Limpiar filtros

# noAssignedTasksTitle
source: No assigned tasks
es: Sin tareas asignadas

# noAssignedTasksMessage
source: You have no tasks assigned in this workspace.
es: No tienes tareas asignadas en este workspace.

source: Create task
es: Crear tarea

# confirmCompleteTitle
source: Complete Task
es: Completar Tarea

# confirmCompleteMessage
source: Mark "{title}" as completed?
es: ¿Marcar "{title}" como completada?

# confirmDeleteTitle
source: Delete Task
es: Eliminar Tarea

# confirmDeleteMessage
source: Delete "{title}"? This action cannot be undone.
es: ¿Eliminar "{title}"? Esta acción no se puede deshacer.

source: Complete
es: Completar

source: Delete
es: Eliminar

# tasksUpdatedSnack
source: Tasks updated
es: Tareas actualizadas

# tasksUpdateFailedSnack
source: We couldn't update tasks. Please try again.
es: No pudimos actualizar las tareas. Intenta de nuevo.

# taskAlreadyCompleted
source: Task is already completed
es: La tarea ya está completada

# noPermissionsCreateTasks
source: You don't have permissions to create tasks in this workspace.
es: No tienes permisos para crear tareas en este workspace.

# updatingWorkspaceTasks
source: We are updating workspace tasks. Please try again in a few seconds.
es: Estamos actualizando las tareas del workspace. Intenta de nuevo en unos segundos.

# mustSelectWorkspaceMessage
source: You must select an active workspace before creating tasks.
es: Debes seleccionar un workspace activo antes de crear tareas.

source: View workspaces
es: Ver workspaces

# needProjectTitle
source: A project is required
es: Necesitas un proyecto

# needProjectMessage
source: Create a project first to register tasks in this workspace.
es: Crea un proyecto primero para poder registrar tareas en este workspace.

source: Go to projects
es: Ir a proyectos

# quickActionsTitle
source: Quick Actions
es: Acciones Rápidas

source: Create project
es: Crear proyecto

source: Invite Member
es: Invitar Miembro

# loadDataError
source: Error loading data
es: Error al cargar datos

source: No tasks to show
es: No hay tareas para mostrar

# noDataWithFilters
source: No data with applied filters
es: No hay datos con los filtros aplicados

# priorityDistributionTitle
source: Priority Distribution
es: Distribución por Prioridad

# weeklyProgressTitle
source: Weekly Progress
es: Progreso Semanal

source: Tasks completed per day
es: Tareas completadas por día

# tasksCount
source: {count} tasks
es: {count} tareas

# taskMetricsTitle
source: Task Metrics
es: Métricas de Tareas

# filteredLabel
source: Filtered
es: Filtrado

# loadMetricsError
source: Error loading metrics
es: Error al cargar métricas

source: {completed} of {total} tasks
es: {completed} de {total} tareas

# notificationPreferencesTitle
source: Notification Preferences
es: Preferencias de Notificación

source: Notification Channels
es: Canales de Notificación

# pushNotificationsTitle
source: Push Notifications
es: Notificaciones Push

# pushNotificationsSubtitle
source: Receive real-time notifications on this device
es: Recibir notificaciones en tiempo real en este dispositivo

# emailNotificationsTitle
source: Email Notifications
es: Notificaciones por Email

# emailNotificationsSubtitle
source: Receive summaries and alerts by email
es: Recibir resúmenes y alertas por correo electrónico

source: Notification Types
es: Tipos de Notificación

# notificationTypesSubtitle
source: Select which events you want to be notified about
es: Selecciona qué eventos quieres recibir notificaciones

# mentionNotifications
source: Mentions
es: Menciones

# mentionNotificationsSubtitle
source: When someone mentions you in a comment
es: Cuando alguien te menciona en un comentario

# commentReplyNotifications
source: Comment replies
es: Respuestas a Comentarios

# commentReplyNotificationsSubtitle
source: When someone replies to your comment
es: Cuando alguien responde a tu comentario

# taskAssignedNotifications
source: Task assigned
es: Tareas Asignadas

# taskAssignedNotificationsSubtitle
source: When a new task is assigned to you
es: Cuando te asignan una nueva tarea

# taskUpdatedNotifications
source: Task updated
es: Actualizaciones de Tareas

# taskUpdatedNotificationsSubtitle
source: When a task you follow is updated
es: Cuando se actualiza una tarea que sigues

# projectUpdatedNotifications
source: Project updated
es: Actualizaciones de Proyectos

# projectUpdatedNotificationsSubtitle
source: When a project is updated
es: Cuando se actualiza un proyecto

# systemNotifications
source: System
es: Notificaciones del Sistema

# systemNotificationsSubtitle
source: Important updates and announcements
es: Actualizaciones y anuncios importantes

source: Preferences updated
es: Preferencias actualizadas

# preferencesLoadError
source: Error loading preferences: {error}
es: Error al cargar preferencias: {error}

# preferencesUpdateError
source: Error updating preferences: {error}
es: Error al actualizar preferencias: {error}

# selectTimezoneTitle
source: Select time zone
es: Selecciona zona horaria

# pushPermissionsHint
source: Push notifications require system permissions. If you don't receive notifications, check your device settings.
es: Las notificaciones push requieren permisos del sistema. Si no recibes notificaciones, verifica la configuración de tu dispositivo.

# tasksDelayedCount
source: {count} delayed
es: {count} retrasadas

# workSessionsTitle
source: Work Sessions
es: Sesiones de Trabajo

# noPermissionsTrackTime
source: You don't have permissions to track time in this workspace
es: No tienes permisos para registrar tiempo en este workspace

# startLabel
source: Start
es: Iniciar

# stopLabel
source: Stop
es: Detener

# finishLabel
source: Finish
es: Finalizar

# hoursProgressLabel
source: Hours Progress
es: Progreso de Horas

# overtimeHoursLabel
source: Overtime hours
es: Horas excedidas

# finishTaskTitle
source: Finish Task
es: Finalizar Tarea

# finishTaskMessage
source: Are you sure you want to finish this task? This will stop any active timer and mark the task as completed.
es: ¿Estás seguro de que deseas finalizar esta tarea? Esto detendrá cualquier timer activo y marcará la tarea como completada.

# taskFinishedSuccessSnack
source: Task finished successfully!
es: ¡Tarea finalizada exitosamente!

# taskDetailTitle
source: Task Detail
es: Detalle de Tarea

# loadTaskErrorTitle
source: Error loading task
es: Error al cargar tarea

# dependenciesTitle
source: Dependencies
es: Dependencias

# dependenciesCount
source: {count} dependencies
es: {count} dependencias

# taskNumber
source: Task #{id}
es: Tarea #{id}

source: No dependencies
es: No hay dependencias

# descriptionTitle
source: Description
es: Descripción

# datesAndDurationTitle
source: Dates and Duration
es: Fechas y Duración

# startDateLabel
source: Start
es: Inicio

# endDateLabel
source: End
es: Fin

# durationLabel
source: Duration
es: Duración

# durationInDays
source: {count} days
es: {count} días

# assignedToLabel
source: Assigned to
es: Asignado a

# pendingInvitationsTitle
source: Pending Invitations
es: Invitaciones Pendientes

source: Refresh
es: Refrescar

# joinedWorkspaceSnack
source: You've joined "{workspace}"
es: Te has unido a "{workspace}"

# invitationDeclinedSnack
source: Invitation declined
es: Invitación rechazada

# noPendingInvitationsTitle
source: No pending invitations
es: No tienes invitaciones pendientes

# noPendingInvitationsMessage
source: When someone invites you to a workspace it will appear here
es: Cuando alguien te invite a un workspace aparecerá aquí

# invitedByLabel
source: Invited by
es: Invitado por

# invitedAt
source: Invited {value}
es: Invitado {value}

# invitationExpired
source: Expired
es: Expirada

# expiresAt
source: Expires {value}
es: Expira {value}

# reject
source: Decline
es: Rechazar

source: Accept
es: Aceptar

# invitationExpiredMessage
source: This invitation has expired
es: Esta invitación ha expirado

# acceptInvitationTitle
source: Accept Invitation
es: Aceptar Invitación

# acceptInvitationMessage
source: Do you want to join "{workspace}" as {role}?
es: ¿Deseas unirte a "{workspace}" como {role}?

# declineInvitationTitle
source: Decline Invitation
es: Rechazar Invitación

# declineInvitationMessage
source: Are you sure you want to decline the invitation to "{workspace}"?
es: ¿Estás seguro de que deseas rechazar la invitación de "{workspace}"?

# declineInvitationNote
source: The administrator can send you a new invitation in the future.
es: El administrador puede enviarte una nueva invitación en el futuro.

# confirmDeclineLabel
source: Yes, Decline
es: Sí, Rechazar

source: tomorrow
es: mañana

source: yesterday
es: ayer

# inHours
source: in {count} {unit}
es: en {count} {unit}

# inMinutes
source: in {count} {unit}
es: en {count} {unit}

# inDays
source: in {count} {unit}
es: en {count} {unit}

# workspaceMembersTitle
source: Workspace Members
es: Miembros del Workspace

source: Close search
es: Cerrar búsqueda

source: Filter by role
es: Filtrar por rol

# ownersRoleLabel
source: Owners
es: Propietarios

# adminsRoleLabel
source: Admins
es: Administradores

# membersRoleLabel
source: Members
es: Miembros

# guestsRoleLabel
source: Guests
es: Invitados

# memberRoleUpdated
source: Role of {user} updated to {role}
es: Rol de {user} actualizado a {role}

# memberRemovedSnack
source: Member removed from workspace
es: Miembro removido del workspace

# youChip
source: You
es: Tú

# activeChip
source: Active
es: Activo

# changeRoleAction
source: Change Role
es: Cambiar Rol

# removeAction
source: Remove
es: Remover

# noMembersWithRole
source: No members with that role
es: No hay miembros con ese rol

# noMembersInWorkspace
source: No members in this workspace
es: No hay miembros en este workspace

source: Try another filter
es: Prueba con otro filtro

source: Invite people to collaborate
es: Invita a personas para colaborar

# changeRoleTitle
source: Change role of {name}
es: Cambiar rol de {name}

# removeMemberTitle
source: Remove Member
es: Remover Miembro

# removeMemberConfirm
source: Are you sure you want to remove {name} from the workspace?
es: ¿Estás seguro de que deseas remover a {name} del workspace?

# removeMemberNote
source: The user will lose access to all projects and tasks in this workspace.
es: El usuario perderá acceso a todos los proyectos y tareas de este workspace.

# removeMemberInviteAgainNote
source: You can invite them again in the future.
es: Podrás invitarlo nuevamente en el futuro.

# confirmRemoveLabel
source: Yes, Remove
es: Sí, Remover

# searchMembersHint
source: Search members...
es: Buscar miembros...

# invitationSentTo
source: Invitation sent to {email}
es: Invitación enviada a {email}

# membersCount
source: {count} members
es: {count} miembros

# inviteeEmailLabel
source: Invitee email
es: Email del invitado

# inviteeEmailHint
source: example@email.com
es: ejemplo@correo.com

# enterEmailMessage
source: Please enter an email
es: Por favor ingresa un email

# enterValidEmailMessage
source: Please enter a valid email
es: Por favor ingresa un email válido

# workspaceRoleLabel
source: Workspace role
es: Rol en el workspace

# rolePermissionsTitle
source: Role permissions
es: Permisos por rol

# adminRoleDesc
source: Full management except deleting workspace
es: Gestión completa excepto eliminar workspace

# memberRoleDesc
source: Create and manage projects and tasks
es: Crear y gestionar proyectos y tareas

# guestRoleDesc
source: View-only access
es: Solo visualización de contenido

source: Send Invitation
es: Enviar Invitación

# adminRoleCapability
source: Can manage members and settings
es: Puede gestionar miembros y configuración

# memberRoleCapability
source: Can create and manage projects
es: Puede crear y gestionar proyectos

# guestRoleCapability
source: View-only access
es: Solo puede visualizar contenido

# ownerRoleCapability
source: Full control of workspace
es: Control total del workspace

# emailRequired
source: Email is required
es: El correo es obligatorio

# emailInvalid
source: Enter a valid email
es: Ingresa un correo válido

# roleLabel
source: Role
es: Rol

# loadRolePrefsError
source: Error loading preferences: {error}
es: Error al cargar preferencias: {error}

# resetConfigTitle
source: Reset Configuration
es: Resetear Configuración

# resetConfigMessage
source: Do you want to reset all your configuration to your role defaults? This will remove all your customizations.
es: ¿Deseas resetear toda tu configuración a los valores por defecto de tu rol? Esto eliminará todas tus personalizaciones.

source: Reset
es: Resetear

# resetConfigSuccess
source: Configuration reset successfully
es: Configuración reseteada correctamente

# resetConfigError
source: Error resetting configuration
es: Error al resetear configuración

# exportSuccessTitle
source: Export Successful
es: Exportación Exitosa

# exportSuccessMessage
source: Your preferences have been exported successfully.
es: Tus preferencias han sido exportadas correctamente.

source: Share
es: Compartir

# shareSubject
source: My Creapolis preferences
es: Mis preferencias de Creapolis

# shareText
source: Preferences file exported from Creapolis
es: Archivo de preferencias exportado desde Creapolis

# exportPrefsError
source: Error exporting preferences: {error}
es: Error al exportar preferencias: {error}

# importPrefsTitle
source: Import Preferences
es: Importar Preferencias

# importPrefsMessage
source: Importing preferences will replace your current configuration. Do you want to continue?
es: Importar preferencias reemplazará tu configuración actual. ¿Deseas continuar?

# continueLabel
source: Continue
es: Continuar

# selectPrefsFileTitle
source: Select preferences file
es: Seleccionar archivo de preferencias

# filePathError
source: Could not get file path
es: No se pudo obtener la ruta del archivo

# importPrefsSuccess
source: Preferences imported successfully
es: Preferencias importadas correctamente

# importPrefsError
source: Error importing preferences - Check the file
es: Error al importar preferencias - Verifica el archivo

# importPrefsErrorDetail
source: Error importing preferences: {error}
es: Error al importar preferencias: {error}

# rolePreferencesTitle
source: Role-based Preferences
es: Preferencias por Rol

source: More options
es: Más opciones

source: Reset to defaults
es: Resetear a defaults

source: Export preferences
es: Exportar preferencias

source: Import preferences
es: Importar preferencias

# themeLight
source: Light
es: Claro

# themeDark
source: Dark
es: Oscuro

# themeSystem
source: System
es: Sistema

# currentThemeLabel
source: Current theme: {theme}
es: Tema actual: {theme}

# usingCustomizationDefault
source: You are using your customization (default: {defaultTheme})
es: Estás usando tu personalización (default: {defaultTheme})

# usingRoleDefault
source: Using your role default
es: Usando el default de tu rol

source: Revert to role default
es: Volver a default del rol

source: Customize theme
es: Personalizar tema

# widgetsConfigured
source: {count} widgets configured
es: {count} widgets configurados

# usingCustomization
source: You are using your customization
es: Estás usando tu personalización

# usingRoleDashboardDefault
source: Using your role default dashboard
es: Usando el dashboard por defecto de tu rol

source: Customize dashboard
es: Personalizar dashboard

# exportImportTitle
source: Export / Import
es: Exportar / Importar

# exportImportDescription
source: Save or restore your full configuration. Useful to back up preferences or transfer them across devices.
es: Guarda o restaura tu configuración completa. til para respaldar preferencias o transferirlas entre dispositivos.

source: Export
es: Exportar

source: Import
es: Importar

# howItWorksTitle
source: How it works
es: ¿Cómo funciona?

# howItWorksStep1Title
source: 1. Base Configuration
es: 1. Configuración Base

# howItWorksStep1Desc
source: Each role has an optimized default configuration.
es: Cada rol tiene una configuración por defecto optimizada.

# howItWorksStep2Title
source: 2. Customization
es: 2. Personalización

# howItWorksStep2Desc
source: You can change any configuration according to your preferences.
es: Puedes cambiar cualquier configuración según tus preferencias.

# howItWorksStep3Title
source: 3. Indicators
es: 3. Indicadores

# howItWorksStep3Desc
source: Elements marked as "Customized" show what you have modified.
es: Los elementos "Personalizado" muestran qué has modificado.

# howItWorksStep4Title
source: 4. Reset
es: 4. Resetear

# howItWorksStep4Desc
source: Use the reset button to return to role defaults.
es: Usa el botón de resetear para volver a los defaults del rol.

# howItWorksStep5Title
source: 5. Export/Import
es: 5. Exportar/Importar

# howItWorksStep5Desc
source: Back up your configuration or transfer it across devices.
es: Respalda tu configuración o transfiérela entre dispositivos.

# roleCustomizationTitle
source: Role Customization
es: Personalización por Rol

# roleCustomizationSubtitle
source: Customize your experience according to your role
es: Personaliza tu experiencia según tu rol

# appearanceTitle
source: Appearance
es: Apariencia

# navigationTypeTitle
source: Navigation type
es: Tipo de navegación

# navigationTypeDescription
source: Select how you prefer to navigate the app
es: Selecciona cómo prefieres navegar por la aplicación

# sidebarTitle
source: Sidebar
es: Barra lateral

# sidebarSubtitle
source: Navigation menu on the side
es: Menú de navegación en el lateral

# bottomNavigationTitle
source: Bottom navigation
es: Navegación inferior

# bottomNavigationSubtitle
source: Navigation menu at the bottom
es: Menú de navegación en la parte inferior

# integrationsTitle
source: Integrations
es: Integraciones

# googleCalendarSubtitle
source: Sync your events and availability
es: Sincroniza tus eventos y disponibilidad
